const fs = require('fs');
const pdf = require('html-pdf');

// Параметры конвертера
const options = { width: '210mm', height: '297mm', border:'10mm' };

// Массив названий файлов
const files = [
  'ЗАЯВА_1',
  'ЗАЯВА_2',
  'ЗАЯВА_3',
  'ЗАЯВА_4',
  'ДОКУМЕНТ_ПРО_ОПЛАТУ',
  'КЛОПОТАННЯ_ДР_1',
  'КЛОПОТАННЯ_ДР_2',
  'КЛОПОТАННЯ_ДУБЛІКАТ',
  'КЛОПОТАННЯ_ЗАЯВКА',
  'ПОВЕРНЕННЯ',
  'ПОВІДОМЛЕННЯ_1',
  'ПОВІДОМЛЕННЯ_2',
  'РІШЕННЯ_1',
  'РІШЕННЯ_1_ВІДМ',
  'РІШЕННЯ_1_ВІДМ_опл',
  'РІШЕННЯ_1_опл',
  'РІШЕННЯ_2',
  'РІШЕННЯ_2_ВІДМ',
  'РІШЕННЯ_2_ВІДМ_опл',
  'РІШЕННЯ_2_опл',
  'РІШЕННЯ_3_1',
  'РІШЕННЯ_3_1_ВІДМ',
  'РІШЕННЯ_3_1_ВІДМ_опл',
  'РІШЕННЯ_3_2',
  'РІШЕННЯ_3_2_ВІДМ_опл',
  'РІШЕННЯ_4_ВІДМ',
  'РІШЕННЯ_4_ВІДМ_опл',
  'РІШЕННЯ_4_повн',
  'РІШЕННЯ_4_част',
  'СВІДОЦ_1',
  'СВІДОЦ_1_оприл',
  'СВІДОЦ_2',
  'СВІДОЦ_2_оприл',
  'СУПР_СВІДОЦ',
];

// Конвертация
files.forEach(function(item) {
    let html = fs.readFileSync('./dist/' + item + '.html', 'utf8');
    pdf.create(html, options).toFile('./dist/pdf/' + item + '.pdf', function(err, res) {
        if (err) return console.log(err);
        console.log(res);
    });
});
